/*==============================================================================

   頂点管理[polygon.h]
														 Author :
														 Date   :
--------------------------------------------------------------------------------

==============================================================================*/
#pragma once


#include "main.h"
#include "renderer.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
// プレイヤー構造体
struct PIXEL
{
	D3DXVECTOR2					size;					// 幅と高さ
	D3DXVECTOR2				pos;					// ポリゴンの座標
	float					rot;					// ポリゴンの回転量
	int						texture;					// テクスチャ番号
	D3DXCOLOR				color;
	float					r, g, b, a;
};

struct TIP
{
	D3DXVECTOR2					size;					// 幅と高さ
	D3DXVECTOR2				pos;					// ポリゴンの座標
	bool drawflag;
};


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitPlayer(void);
void UninitPlayer(void);
void UpdatePlayer(void);
void DrawPlayer(void);
